swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_sys_ctrl.c
/**************************************************************************//**
* @file        rtl8735b_sys_ctrl.c
* @brief       This file implements the SYSON control HAL functions.
*
* @version     V1.00
* @date        2021-08-07
*
* @note
*
******************************************************************************
*
* Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the License); you may
* not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an AS IS BASIS, WITHOUT
* WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*
******************************************************************************/
#include "cmsis.h"
#include "rtl8735b_sys_ctrl.h"
#include "rtl8735b_syson_s_type.h"
#include "rtl8735b_pon_type.h"
#include "rtl8735b.h"


#define SECTION_SYS_CTRL_TEXT           SECTION(".rom.hal_sys_ctrl.text")
#define SECTION_SYS_CTRL_DATA           SECTION(".rom.hal_sys_ctrl.data")
#define SECTION_SYS_CTRL_RODATA         SECTION(".rom.hal_sys_ctrl.rodata")
#define SECTION_SYS_CTRL_BSS            SECTION(".rom.hal_sys_ctrl.bss")
#define SECTION_SYS_CTRL_STUBS          SECTION(".rom.hal_sys_ctrl.stubs")


/// @cond DOXYGEN_ROM_HAL_API

/**
 * @addtogroup hal_sys_ctrl_rom_func SYS CTRL HAL ROM APIs.
 * @ingroup hs_hal_i2c
 * @{
 * @brief The SYS CTRL HAL ROM APIs. The user application(in RAM space) should not call these APIs directly.
 *        There is another set of SYSON CTRL HAL APIs in the RAM space is provided for the user application.
 */

/**
  * \brief The stubs functions table to exports SYS CTRL HAL functions in ROM.
*/
SECTION_SYS_CTRL_STUBS const hal_sys_ctrl_func_stubs_t hal_sys_ctrl_stubs = {
	.hal_sys_peripheral_en          = hal_rtl_sys_peripheral_en,
	.hal_sys_set_clk                = hal_rtl_sys_set_clk,
	.hal_sys_get_clk                = hal_rtl_sys_get_clk,
	.hal_sys_boot_info_assign_val   = hal_rtl_sys_boot_info_assign_val,
	.hal_sys_boot_info_get_val      = hal_rtl_sys_boot_info_get_val,
	.hal_sys_boot_footpath_init     = hal_rtl_sys_boot_footpath_init,
	.hal_sys_boot_footpath_store    = hal_rtl_sys_boot_footpath_store,
	.hal_vdr_s_jtag_key_write       = hal_rtl_vdr_s_jtag_key_write,
	.hal_vdr_ns_jtag_key_write      = hal_rtl_vdr_ns_jtag_key_write,
	.hal_sys_get_video_info         = hal_rtl_sys_get_video_info,
	.hal_sys_set_video_info         = hal_rtl_sys_set_video_info,
	.hal_sys_get_chip_id            = hal_rtl_sys_get_chip_id,
	.hal_sys_boot_footpath_clear    = hal_rtl_sys_boot_footpath_clear
};


/**
  * @brief The table of BOOT INFO SW RESV registers.
  */
SECTION_SYS_CTRL_RODATA
const uint32_t *boot_info_sw_reg_list[BOOT_INFO_SW_RESV_MAX_SIZE] = {
	(uint32_t *) &(AON->AON_REG_AON_SW_BOOT0),
	(uint32_t *) &(AON->AON_REG_AON_SW_BOOT1),
	(uint32_t *) &(AON->AON_REG_AON_SW_BOOT2),
	(uint32_t *) &(AON->AON_REG_AON_SW_BOOT3),
	(uint32_t *) &(AON->AON_REG_AON_SW_BOOT4)
};

#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
SECTION_SYS_CTRL_TEXT
uint8_t hal_rtl_sys_get_rma_state(void)
{
	PON_TypeDef *pon = PON;
	volatile uint32_t reg_val;
	uint8_t rma_state = RMA_NORMAL_STATE;
	reg_val = PON->PON_REG_RMA_CTRL0;
	rma_state = ((reg_val & PON_MASK_RMA_STATE) >> PON_SHIFT_RMA_STATE);
	return rma_state;
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_en_rma_mgn_pg(void)
{
	PON_TypeDef *pon = PON;
	volatile uint32_t reg_val;
	const uint8_t en_ctrl = 0x65;

	uint8_t rma_state = RMA_NORMAL_STATE;
	reg_val = PON->PON_REG_RMA_CTRL0;
	reg_val &= (~PON_MASK_PWD_EN);
	reg_val |= (en_ctrl << PON_SHIFT_PWD_EN);
	PON->PON_REG_RMA_CTRL0 = reg_val;
}
#endif

SECTION_SYS_CTRL_TEXT
uint32_t hal_rtl_sys_boot_info_get_val(uint8_t info_idx)
{
	// AON 0x140,0x148,0x14C,0x150,0x154
	volatile uint32_t reg_val;
	if (info_idx >= BOOT_INFO_SW_RESV_MAX_SIZE) {
		return 0x0;
	}
	reg_val = *((uint32_t *)boot_info_sw_reg_list[info_idx]);
	return reg_val;
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_boot_info_assign_val(uint8_t info_idx, uint32_t info_v)
{
	// AON 0x140,0x148,0x14C,0x150,0x154
	volatile uint32_t reg_val;
	if (info_idx >= BOOT_INFO_SW_RESV_MAX_SIZE) {
		return;
	}
	reg_val = info_v;
	*((uint32_t *)boot_info_sw_reg_list[info_idx]) = reg_val;
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_boot_footpath_init(uint8_t info_idx)
{
	// AON 0x140,0x148,0x14C,0x150,0x154
	if (info_idx >= BOOT_INFO_SW_RESV_MAX_SIZE) {
		return;
	}
	hal_rtl_sys_boot_info_assign_val(info_idx, 0x0);   // clear [31:0]
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_boot_footpath_store(uint8_t info_idx, uint8_t fp_v)
{
	// AON 0x140,0x148,0x14C,0x150,0x154
	volatile uint32_t reg_val;
	if (info_idx >= BOOT_INFO_SW_RESV_MAX_SIZE) {
		return;
	}
	if ((fp_v >= 0) && (fp_v < 32)) {
		reg_val = *((uint32_t *)boot_info_sw_reg_list[info_idx]);
		reg_val |= (0x1 << fp_v);
		*((uint32_t *)boot_info_sw_reg_list[info_idx]) = reg_val;
	}
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_boot_footpath_clear(uint8_t info_idx, uint8_t fp_v)
{
	// AON 0x140,0x148,0x14C,0x150,0x154
	volatile uint32_t reg_val;
	if (info_idx >= BOOT_INFO_SW_RESV_MAX_SIZE) {
		return;
	}
	if ((fp_v >= 0) && (fp_v < 32)) {
		reg_val = *((uint32_t *)boot_info_sw_reg_list[info_idx]);
		reg_val &= (~(0x1 << fp_v));
		*((uint32_t *)boot_info_sw_reg_list[info_idx]) = reg_val;
	}
}

/**

        \addtogroup hal_rtl_sys
        @{
*/
SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_peripheral_en(uint8_t id, uint8_t en)
{
	SYSON_S_TypeDef *syson_s = SYSON_S;
	PON_TypeDef *pon = PON;
	AON_TypeDef *aon = AON;
	volatile uint32_t val;

	switch (id) {
	case EDDSA_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= SYSON_S_BIT_HS_ED255_CLK_EN | SYSON_S_BIT_HS_ED255_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &= ~(SYSON_S_BIT_HS_ED255_CLK_EN | SYSON_S_BIT_HS_ED255_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;
	case GPIO_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_GPIO_CTRL;
			val |= SYSON_S_BIT_SYS_GPIO_EN | SYSON_S_BIT_SYS_GPIO_PCLK_EN | SYSON_S_BIT_SYS_GPIO_SCLK_EN;
			syson_s->SYSON_S_REG_GPIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_GPIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_GPIO_EN | SYSON_S_BIT_SYS_GPIO_PCLK_EN | SYSON_S_BIT_SYS_GPIO_SCLK_EN);
			syson_s->SYSON_S_REG_GPIO_CTRL = val;
		}
		break;
	case GPIO_PON:
		if (en == ENABLE) {
			// 1. Enable PON GPIO PCLK/SCLK
			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val |= (PON_BIT_PCLK_GPIO_EN | PON_BIT_SCLK_GPIO_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;

			// 2. Enable PON GPIO
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val |= PON_BIT_GPIO_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;
		} else { // en == DISABLE // Note: PON will NOT be disabled
			// 1. Disable PON GPIO
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val &= ~(PON_BIT_GPIO_EN);
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			// 2. Disable PON GPIO PCLK/SCLK
			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val &= ~(PON_BIT_PCLK_GPIO_EN | PON_BIT_SCLK_GPIO_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		}
		break;
	case GPIO_AON:
		if (en == ENABLE) {
			// 1. Enable AON GPIO SCLK/PCLK
			val = aon->AON_REG_AON_CLK_CTRL;
			val |= AON_BIT_GPIO_PCLK_EN | AON_BIT_GPIO_SCLK_EN;
			aon->AON_REG_AON_CLK_CTRL = val;

