swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_sys_ctrl.c
			// 2. Enable AON GPIO
			val = aon->AON_REG_AON_FUNC_CTRL;
			val |= AON_BIT_GPIO_FEN;
			aon->AON_REG_AON_FUNC_CTRL = val;
		} else { // en == DISABLE
			// 1. Disable AON GPIO
			val = aon->AON_REG_AON_FUNC_CTRL;
			val &= ~(AON_BIT_GPIO_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// 2. Disable AON GPIO SCLK/PCLK
			val = aon->AON_REG_AON_CLK_CTRL;
			val &= ~(AON_BIT_GPIO_PCLK_EN | AON_BIT_GPIO_SCLK_EN);
			aon->AON_REG_AON_CLK_CTRL = val;
		}
		break;
	case DDR_SYS:
		if (en == ENABLE) {
			syson_s->SYSON_S_REG_SYS_LPDDR1_CTRL = SYSON_S_BIT_HS_LPDDR1_EN | SYSON_S_BIT_HS_LPDDR1_CLK_EN;
			syson_s->SYSON_S_REG_SYS_DDRPHY_CTRL = SYSON_S_BIT_HS_DDRPHY_CRT_RST | SYSON_S_BIT_PWDPAD15N | SYSON_S_BIT_DDRPHY_RBUS_EN | SYSON_S_BIT_DDRPHY_VCCON |
												   SYSON_S_BIT_HS_DDRPHY_RBUS_CLK_EN | SYSON_S_BIT_HS_DDRPHY_CRT_CLK_EN;
		} else { //en == DISABLE
		}
		break;
	case ENC_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val |= SYSON_S_BIT_SYS_ENCODER_EN | SYSON_S_BIT_SYS_ENCODER_CLK_EN;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
		} else { //en == DISABLE
		}
		break;
	case GDMA0_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |=  SYSON_S_BIT_HS_GDMA0_CLK_ALWS_EN |  SYSON_S_BIT_HS_GDMA0_CLK_EN |  SYSON_S_BIT_HS_GDMA0_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &=  ~(SYSON_S_BIT_HS_GDMA0_CLK_ALWS_EN |  SYSON_S_BIT_HS_GDMA0_CLK_EN |  SYSON_S_BIT_HS_GDMA0_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;
	case GDMA1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |=  SYSON_S_BIT_HS_GDMA1_CLK_ALWS_EN |  SYSON_S_BIT_HS_GDMA1_CLK_EN | SYSON_S_BIT_HS_GDMA1_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &=  ~(SYSON_S_BIT_HS_GDMA1_CLK_ALWS_EN |  SYSON_S_BIT_HS_GDMA1_CLK_EN | SYSON_S_BIT_HS_GDMA1_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;
	case FLASH_SYS: // NOR¡@flash
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
			val |= SYSON_S_BIT_NOR_FLASH_EN | SYSON_S_BIT_NOR_FLASH_CLK_EN;
			syson_s->SYSON_S_REG_SYS_FLASH_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
			val &= ~(SYSON_S_BIT_NOR_FLASH_EN | SYSON_S_BIT_NOR_FLASH_CLK_EN);
			syson_s->SYSON_S_REG_SYS_FLASH_CTRL = val;
		}
		break;
	case SPI0_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val |= SYSON_S_BIT_SYS_SPI0_EN | SYSON_S_BIT_SYS_SPI0_CLK_EN;
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SPI0_EN | SYSON_S_BIT_SYS_SPI0_CLK_EN);
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		}
		break;
	case SPI1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val |= SYSON_S_BIT_SYS_SPI1_EN | SYSON_S_BIT_SYS_SPI1_CLK_EN;
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SPI1_EN | SYSON_S_BIT_SYS_SPI1_CLK_EN);
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		}
		break;
	case HS_SPI0_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val |= SYSON_S_BIT_SYS_HS_SPI0_EN | SYSON_S_BIT_SYS_HS_SPI0_CLK_EN;
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val &= ~(SYSON_S_BIT_SYS_HS_SPI0_EN | SYSON_S_BIT_SYS_HS_SPI0_CLK_EN);
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		}
		break;
	case HS_SPI1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val |= SYSON_S_BIT_SYS_HS_SPI1_EN | SYSON_S_BIT_SYS_HS_SPI1_CLK_EN;
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_SPI_CTRL;
			val &= ~(SYSON_S_BIT_SYS_HS_SPI1_EN | SYSON_S_BIT_SYS_HS_SPI1_CLK_EN);
			syson_s->SYSON_S_REG_SYS_SPI_CTRL = val;
		}
		break;
	case UART0_SYS:
		if (en == ENABLE) {
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val |= PON_BIT_UART0_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val |= PON_BIT_UART0_BD_EN | PON_BIT_PCLK_UART0_EN | PON_BIT_SCLK_UART0_EN;
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		} else { //en == DISABLE
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val &= (~PON_BIT_UART0_EN);
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val &= ~(PON_BIT_UART0_BD_EN | PON_BIT_PCLK_UART0_EN | PON_BIT_SCLK_UART0_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		}
		break;
	case UART1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val |= SYSON_S_BIT_SYS_UART1_EN | SYSON_S_BIT_SYS_UART1_BD_EN | SYSON_S_BIT_SYS_UART1_PCLK_EN | SYSON_S_BIT_SYS_UART1_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val &= ~(SYSON_S_BIT_SYS_UART1_EN | SYSON_S_BIT_SYS_UART1_BD_EN | SYSON_S_BIT_SYS_UART1_PCLK_EN | SYSON_S_BIT_SYS_UART1_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		}
		break;
	case UART2_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val |= SYSON_S_BIT_SYS_UART2_EN | SYSON_S_BIT_SYS_UART2_BD_EN | SYSON_S_BIT_SYS_UART2_PCLK_EN | SYSON_S_BIT_SYS_UART2_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val &= ~(SYSON_S_BIT_SYS_UART2_EN | SYSON_S_BIT_SYS_UART2_BD_EN | SYSON_S_BIT_SYS_UART2_PCLK_EN | SYSON_S_BIT_SYS_UART2_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		}
		break;
	case UART3_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val |= SYSON_S_BIT_SYS_UART3_EN | SYSON_S_BIT_SYS_UART3_BD_EN | SYSON_S_BIT_SYS_UART3_PCLK_EN | SYSON_S_BIT_SYS_UART3_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val &= ~(SYSON_S_BIT_SYS_UART3_EN | SYSON_S_BIT_SYS_UART3_BD_EN | SYSON_S_BIT_SYS_UART3_PCLK_EN | SYSON_S_BIT_SYS_UART3_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		}
		break;
	case UART4_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val |= SYSON_S_BIT_SYS_BT_UART_EN | SYSON_S_BIT_SYS_BT_UART_BD_EN | SYSON_S_BIT_SYS_BT_UART_PCLK_EN | SYSON_S_BIT_SYS_BT_UART_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_UART_CTRL;
			val &= ~(SYSON_S_BIT_SYS_BT_UART_EN | SYSON_S_BIT_SYS_BT_UART_BD_EN | SYSON_S_BIT_SYS_BT_UART_PCLK_EN | SYSON_S_BIT_SYS_BT_UART_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_UART_CTRL = val;
		}
		break;
	case TIMER0_SYS:
		if (en == ENABLE) {
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val |= PON_BIT_TIMER0_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val |= PON_BIT_SCLK_TIMER0_EN | PON_BIT_PCLK_TIMER0_EN;
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;

		} else { //en == DISABLE
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val &= ~PON_BIT_TIMER0_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val &= ~(PON_BIT_SCLK_TIMER0_EN | PON_BIT_PCLK_TIMER0_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		}
		break;
	case TIMER1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val |= SYSON_S_BIT_SYS_TG1_EN | SYSON_S_BIT_SYS_TG1_PCLK_EN | SYSON_S_BIT_SYS_TG1_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val &= ~(SYSON_S_BIT_SYS_TG1_EN | SYSON_S_BIT_SYS_TG1_PCLK_EN | SYSON_S_BIT_SYS_TG1_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		}
		break;
	case TIMER2_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val |= SYSON_S_BIT_SYS_TG2_EN | SYSON_S_BIT_SYS_TG2_PCLK_EN | SYSON_S_BIT_SYS_TG2_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val &= ~(SYSON_S_BIT_SYS_TG2_EN | SYSON_S_BIT_SYS_TG2_PCLK_EN | SYSON_S_BIT_SYS_TG2_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		}
		break;
	case TIMER3_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val |= SYSON_S_BIT_SYS_TG3_EN | SYSON_S_BIT_SYS_TG3_PCLK_EN | SYSON_S_BIT_SYS_TG3_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
			val &= ~(SYSON_S_BIT_SYS_TG3_EN | SYSON_S_BIT_SYS_TG3_PCLK_EN | SYSON_S_BIT_SYS_TG3_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		}
		break;
	case PWM_SYS:
		if (en == ENABLE) {
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val |= PON_BIT_PWM_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val |= (PON_BIT_SCLK_PWM_EN | PON_BIT_PCLK_PWM_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;

		} else { //en == DISABLE
			val = pon->PON_REG_PON_FUNC_EN_CTRL;
			val &= ~PON_BIT_PWM_EN;
			pon->PON_REG_PON_FUNC_EN_CTRL = val;

			val = pon->PON_REG_PON_FUNC_CLK_CTRL;
			val &= ~(PON_BIT_SCLK_PWM_EN | PON_BIT_PCLK_PWM_EN);
			pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		}
		break;
	case CRYPTO_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= SYSON_S_BIT_HS_IPSEC_EN | SYSON_S_BIT_HS_IPSEC_CLK_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &= ~(SYSON_S_BIT_HS_IPSEC_EN | SYSON_S_BIT_HS_IPSEC_CLK_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;
	case RSA_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_RSA_FUNC_CTRL;
			val |= (SYSON_S_BIT_RSA_EN | SYSON_S_BIT_RSA_CLK_EN);
			syson_s->SYSON_S_REG_SYS_RSA_FUNC_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_RSA_FUNC_CTRL;
			val &= ~(SYSON_S_BIT_RSA_EN | SYSON_S_BIT_RSA_CLK_EN);
			syson_s->SYSON_S_REG_SYS_RSA_FUNC_CTRL = val;
		}
		break;
	case I2C0_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val |= SYSON_S_BIT_SYS_I2C0_EN | SYSON_S_BIT_SYS_I2C0_PCLK_EN | SYSON_S_BIT_SYS_I2C0_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2C0_EN | SYSON_S_BIT_SYS_I2C0_PCLK_EN | SYSON_S_BIT_SYS_I2C0_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

