swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_sys_ctrl.c
		}
		break;
	case I2C1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val |= SYSON_S_BIT_SYS_I2C1_EN | SYSON_S_BIT_SYS_I2C1_PCLK_EN | SYSON_S_BIT_SYS_I2C1_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2C1_EN | SYSON_S_BIT_SYS_I2C1_PCLK_EN | SYSON_S_BIT_SYS_I2C1_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		}
		break;

	case I2C2_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val |= SYSON_S_BIT_SYS_I2C2_EN | SYSON_S_BIT_SYS_I2C2_PCLK_EN | SYSON_S_BIT_SYS_I2C2_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2C2_EN | SYSON_S_BIT_SYS_I2C2_PCLK_EN | SYSON_S_BIT_SYS_I2C2_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		}
		break;

	case I2C3_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val |= SYSON_S_BIT_SYS_I2C3_EN | SYSON_S_BIT_SYS_I2C3_PCLK_EN | SYSON_S_BIT_SYS_I2C3_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2C_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2C3_EN | SYSON_S_BIT_SYS_I2C3_PCLK_EN | SYSON_S_BIT_SYS_I2C3_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_I2C_CTRL = val;

		}
		break;

	case ECDSA_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= SYSON_S_BIT_HS_ECC_EN | SYSON_S_BIT_HS_ECC_CLK_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &= ~(SYSON_S_BIT_HS_ECC_EN | SYSON_S_BIT_HS_ECC_CLK_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;

	case ADC_SYS:
		if (en == ENABLE) {
			// 0. Turn on SWR (Switching Regulator) 1.35V
			val = aon->AON_REG_SWR_SRC_CTRL0;
			val |= AON_BIT_SRC_POW_SW;
			aon->AON_REG_SWR_SRC_CTRL0 = val;

			// 1. Turn on pow BG.
			val = aon->AON_REG_AON_PLL_CTRL0;
			val |= AON_BIT_PLL_POW_BG;
			aon->AON_REG_AON_PLL_CTRL0 = val;
			hal_delay_us(100);

			// 2. Turn on pow BG current, together with power on MBIAS
			val = aon->AON_REG_AON_PLL_CTRL0;
			val |= (AON_BIT_PLL_POW_I | AON_BIT_PLL_POW_MBIAS);
			aon->AON_REG_AON_PLL_CTRL0 = val;
			hal_delay_us(10);

			// 3. Turn on LDO09 (1.3V to 0.9V LDO) and LDO18 (3.3V to 1.8V LDO) together
			val = aon->AON_REG_AON_PLL_CTRL0;
			val |= (AON_BIT_POW_LDO09 | AON_BIT_POW_LDO18) ;
			aon->AON_REG_AON_PLL_CTRL0 = val;

			hal_delay_us(10);

			// 4. Enable pow adc refgen
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL0;
			val |= SYSON_S_BIT_POW_REF;
			syson_s->SYSON_S_REG_SYS_ADC_CTRL0 = val;

			hal_delay_us(20);

			// 5. Enable ADC block, PCLK and SCLK
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL1;
			val |= (SYSON_S_BIT_SYS_ADC_EN | SYSON_S_BIT_SYS_ADC_PCLK_EN | SYSON_S_BIT_SYS_ADC_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_ADC_CTRL1 = val;

			// 6. Disable ADC analog to digital domain isolation
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL1;
			val &= ~(SYSON_S_BIT_SYS_ISO_ADC);
			syson_s->SYSON_S_REG_SYS_ADC_CTRL1 = val;

		} else { //en == DISABLE

			// As BG and MBIAS may be used by many IPs, ADC will not turn these signals off

			// 1. Re-enable ADC analog to digital domain isolation
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL1;
			val |= SYSON_S_BIT_SYS_ISO_ADC;
			syson_s->SYSON_S_REG_SYS_ADC_CTRL1 = val;

			// 2. Disable ADC block, PCLK and SCLK
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL1;
			val &= ~(SYSON_S_BIT_SYS_ADC_EN | SYSON_S_BIT_SYS_ADC_PCLK_EN | SYSON_S_BIT_SYS_ADC_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_ADC_CTRL1 = val;

			hal_delay_us(20);

			// 3. Disable pow adc refgen
			val = syson_s->SYSON_S_REG_SYS_ADC_CTRL0;
			val &= ~(SYSON_S_BIT_POW_REF);
			syson_s->SYSON_S_REG_SYS_ADC_CTRL0 = val;
		}
		break;

	case RTC_SYS:
		if (en == ENABLE) {
			// 1. Enable RTC clock
			val = aon->AON_REG_AON_CLK_CTRL;
			val |= (AON_BIT_RTC_CK_FEN);
			aon->AON_REG_AON_CLK_CTRL = val;

			// 2. Enable RTC
			val = aon->AON_REG_AON_FUNC_CTRL;
			val |= (AON_BIT_RTC_INTF_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// 3. Enable RTC WAKE_EVENT_MS
			//val = aon->AON_REG_AON_SLP_WAKE_EVENT_MSK0;
			//val |= (AON_BIT_AON_WEVT_AON_RTC_MSK);
			//aon->AON_REG_AON_FUNC_CTRL = val;
		} else { // en == DISABLE
			// 1. Disable RTC
			val = aon->AON_REG_AON_FUNC_CTRL;
			val &= ~(AON_BIT_RTC_INTF_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// 2. Disable RTC clock
			val = aon->AON_REG_AON_CLK_CTRL;
			val &= (AON_BIT_RTC_CK_FEN);
			aon->AON_REG_AON_CLK_CTRL = val;

			// 3. Disable RTC WAKE_EVENT_MS
			//val = aon->AON_REG_AON_SLP_WAKE_EVENT_MSK0;
			//val |= ~(AON_BIT_AON_WEVT_AON_RTC_MSK);
			//aon->AON_REG_AON_FUNC_CTRL = val;
		}
		break;

	case ISP_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val |= SYSON_S_BIT_SYS_ISP_EN ;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val |= SYSON_S_BIT_SYS_ISP_CLK_EN;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;

		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val &= ~SYSON_S_BIT_SYS_ISP_CLK_EN;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val &= ~SYSON_S_BIT_SYS_ISP_EN;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;


		}
		break;
	case NN_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
			val |= SYSON_S_BIT_SYS_NN_CLK_EN;
			syson_s->SYSON_S_REG_SYS_NN_CTRL = val;

			val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
			val |= SYSON_S_BIT_SYS_NN_EN;
			syson_s->SYSON_S_REG_SYS_NN_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
			val &= ~SYSON_S_BIT_SYS_NN_CLK_EN;
			syson_s->SYSON_S_REG_SYS_NN_CTRL = val;
			val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
			val &= ~SYSON_S_BIT_SYS_NN_EN;
			syson_s->SYSON_S_REG_SYS_NN_CTRL = val;
		}
		break;
	case SPORT_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_SPORT_EN | SYSON_S_BIT_SYS_SPORT_PCLK_EN | SYSON_S_BIT_SYS_SPORT_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SPORT_EN | SYSON_S_BIT_SYS_SPORT_PCLK_EN | SYSON_S_BIT_SYS_SPORT_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case I2S0_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val |= SYSON_S_BIT_SYS_I2S0_EN | SYSON_S_BIT_SYS_I2S0_CLK_EN;
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2S0_EN | SYSON_S_BIT_SYS_I2S0_CLK_EN);
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		}
		break;

	case I2S1_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val |= SYSON_S_BIT_SYS_I2S1_EN | SYSON_S_BIT_SYS_I2S1_CLK_EN;
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val &= ~(SYSON_S_BIT_SYS_I2S1_EN | SYSON_S_BIT_SYS_I2S1_CLK_EN);
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		}
		break;

	case LXBUS_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= SYSON_S_BIT_LXBUS_EN | SYSON_S_BIT_LXBUS_CLK_EN;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &= ~(SYSON_S_BIT_LXBUS_EN | SYSON_S_BIT_LXBUS_CLK_EN);
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
		}
		break;

	case SGPIO_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val |= SYSON_S_BIT_SYS_SGPIO0_INT_CLK_SEL | SYSON_S_BIT_SYS_SGPIO0_SCLK_EN | SYSON_S_BIT_SYS_SGPIO0_PCLK_EN | SYSON_S_BIT_SYS_SGPIO0_EN;
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_I2S_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SGPIO0_INT_CLK_SEL | SYSON_S_BIT_SYS_SGPIO0_SCLK_EN | SYSON_S_BIT_SYS_SGPIO0_PCLK_EN | SYSON_S_BIT_SYS_SGPIO0_EN);
			syson_s->SYSON_S_REG_SYS_I2S_CTRL = val;
		}
		break;

	case VOE_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val |= (SYSON_S_BIT_SYS_VOE_CLK_EN | SYSON_S_BIT_SYS_VOE_EN) ;
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;


		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
			val &= ~(SYSON_S_BIT_SYS_VOE_CLK_EN | SYSON_S_BIT_SYS_VOE_EN);
			syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;

