swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_sys_ctrl.c
		}
		break;


	case TRNG_32K:
		if (en == ENABLE) {

			//enable REG_AON_SRC_CLK_CTRL
			val = aon->AON_REG_AON_SRC_CLK_CTRL;
			val |= (AON_BIT_COMP_SCLK_SEL | (1 << AON_SHIFT_LP_CLK_SEL) | AON_BIT_TIMER_SCLK_SEL) ;
			aon->AON_REG_AON_SRC_CLK_CTRL = val;

			//  Enable PON in AON register
			val = aon->AON_REG_AON_FUNC_CTRL;
			val |= (AON_BIT_SDM_FEN | AON_BIT_SYS_PON_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// enable syson
			val = pon->PON_REG_PON_SYSON_CTRL;
			val |= (PON_BIT_SYSON_REG_EN | PON_BIT_SYSON_CLK_EN | PON_BIT_SYSON_LPC_EN | PON_BIT_PLATFORM_CLK_EN) ;
			pon->PON_REG_PON_SYSON_CTRL = val;

			//set SYSON_S_REG_SYS_PLATFORM_CTRL0
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val &= ~(SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL); //32k clock sources
			val |= (SYSON_S_BIT_HS_TRNG_HI_CLK_SEL  | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN) ;//32k clock sources
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;
			hal_delay_ms(5);

		} else { //en == DISABLE
			//disable SYSON_S_REG_SYS_PLATFORM_CTRL0
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= ~(SYSON_S_BIT_HS_TRNG_HI_CLK_SEL | SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN) ;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;

		}
		break;

	case TRNG_128K:
		if (en == ENABLE) {

			//enable REG_AON_SRC_CLK_CTRL
			val = aon->AON_REG_AON_SRC_CLK_CTRL;
			val |= (AON_BIT_COMP_SCLK_SEL | (1 << AON_SHIFT_LP_CLK_SEL) | AON_BIT_TIMER_SCLK_SEL) ;
			aon->AON_REG_AON_SRC_CLK_CTRL = val;

			//  Enable PON in AON register
			val = aon->AON_REG_AON_FUNC_CTRL;
			val |= (AON_BIT_SDM_FEN | AON_BIT_SYS_PON_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// enable syson
			val = pon->PON_REG_PON_SYSON_CTRL;
			val |= (PON_BIT_SYSON_REG_EN | PON_BIT_SYSON_CLK_EN | PON_BIT_SYSON_LPC_EN | PON_BIT_PLATFORM_CLK_EN) ;
			pon->PON_REG_PON_SYSON_CTRL = val;
			// set up trng
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= (SYSON_S_BIT_HS_TRNG_HI_CLK_SEL  | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN | SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL) ; //128L clock
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;


		} else { //en == DISABLE

			//disable SYSON_S_REG_SYS_PLATFORM_CTRL0
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= ~(SYSON_S_BIT_HS_TRNG_HI_CLK_SEL | SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN) ;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;

		}
		break;
	case TRNG_SYS:
		if (en == ENABLE) {

			//enable REG_AON_SRC_CLK_CTRL
			val = aon->AON_REG_AON_SRC_CLK_CTRL;
			val |= (AON_BIT_COMP_SCLK_SEL | (1 << AON_SHIFT_LP_CLK_SEL) | AON_BIT_TIMER_SCLK_SEL) ;
			aon->AON_REG_AON_SRC_CLK_CTRL = val;

			//  Enable PON in AON register
			val = aon->AON_REG_AON_FUNC_CTRL;
			val |= (AON_BIT_SDM_FEN | AON_BIT_SYS_PON_FEN);
			aon->AON_REG_AON_FUNC_CTRL = val;

			// enable syson
			val = pon->PON_REG_PON_SYSON_CTRL;
			val |= (PON_BIT_SYSON_REG_EN | PON_BIT_SYSON_CLK_EN | PON_BIT_SYSON_LPC_EN | PON_BIT_PLATFORM_CLK_EN) ;
			pon->PON_REG_PON_SYSON_CTRL = val;
			// set up trng
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= (SYSON_S_BIT_HS_TRNG_HI_CLK_SEL  | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN | SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL) ; //128L clock
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;


		} else { //en == DISABLE

			//disable SYSON_S_REG_SYS_PLATFORM_CTRL0
			val = syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0;
			val |= ~(SYSON_S_BIT_HS_TRNG_HI_CLK_SEL | SYSON_S_BIT_HS_TRNG_LOW_CLK_SEL | SYSON_S_BIT_HS_TRNG_CLK_EN | SYSON_S_BIT_HS_TRNG_EN) ;
			syson_s->SYSON_S_REG_SYS_PLATFORM_CTRL0 = val;

		}
		break;
	case SI_SYS:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_SI_EN | SYSON_S_BIT_SYS_SI_PCLK_EN | SYSON_S_BIT_SYS_SI_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SI_EN | SYSON_S_BIT_SYS_SI_PCLK_EN | SYSON_S_BIT_SYS_SI_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case AUDIO_CODEC_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_CODEC_EN;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_CODEC_EN);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case AUDIO_CODEC_SCLK_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_CODEC_SCLK_EN;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_CODEC_SCLK_EN);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case AUDIO_CODEC_PORB_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_CODEC_PORB;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_CODEC_PORB);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case AUDIO_CODEC_LDO_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_CODEC_LDO_EN;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_CODEC_LDO_EN);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case AUDIO_CODEC_EXTE_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val |= SYSON_S_BIT_SYS_SPORT_CODEC_SEL;
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		} else { //en == DISABLE
			val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
			val &= ~(SYSON_S_BIT_SYS_SPORT_CODEC_SEL);
			syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		}
		break;

	case LDO_SDIO_3V3_EN:
		if (en == ENABLE) {
			val = syson_s->SYSON_S_REG_LDO_SDIO_CTRL;

			// 1. Use PMOS Buffer, 3.3V
			val &= ~(SYSON_S_BIT_REG_BUFFERTYPE_SEL_L);
			// 2. Power Cut Enable
			val |= SYSON_S_BIT_EN_PC_BT_L;
			// 3. Normal Mode
			val &= ~(SYSON_S_MASK_REG_STANDBY_L);
			// Assign into SYSON_S_REG_LDO_SDIO_CTRL first
			syson_s->SYSON_S_REG_LDO_SDIO_CTRL = val;

			hal_delay_us(20);

			// 4. Enable LDO SDIO, then assign back to register
			val = syson_s->SYSON_S_REG_LDO_SDIO_CTRL;
			val &= ~(SYSON_S_BIT_PD_REGU_L);
			syson_s->SYSON_S_REG_LDO_SDIO_CTRL = val;

			hal_delay_us(200);

			// 5. Diode disable
			val = syson_s->SYSON_S_REG_LDO_SDIO_CTRL;
			val &= ~(SYSON_S_BIT_EN_DIODE_L);
			syson_s->SYSON_S_REG_LDO_SDIO_CTRL = val;

		} else { //en == DISABLE
			// 1. Disable LDO SDIO and enable diode
			val = syson_s->SYSON_S_REG_LDO_SDIO_CTRL;
			val |= (SYSON_S_BIT_PD_REGU_L | SYSON_S_BIT_EN_DIODE_L);
			syson_s->SYSON_S_REG_LDO_SDIO_CTRL = val;
		}
		break;

	default:
		break;
	}
}


SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_set_clk(uint8_t id, uint8_t sel_val)
{
	AON_TypeDef *aon = AON;
	PON_TypeDef *pon = PON;
	SYSON_S_TypeDef *syson_s = SYSON_S;

	volatile uint32_t val;
	switch (id) {
	case UART0_SYS:
		val = pon->PON_REG_PON_FUNC_CLK_CTRL;
		val &= (~PON_MASK_SCLK_UART0_SEL);
		val |= ((sel_val & 0x3) << PON_SHIFT_SCLK_UART0_SEL);
		pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		break;
	case PWM_SYS:
		val = pon->PON_REG_PON_FUNC_CLK_CTRL;
		val &= (~PON_MASK_SCLK_PWM_SEL);
		val |= ((sel_val & 0x3) << PON_SHIFT_SCLK_PWM_SEL);
		pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		break;
	case TIMER0_SYS:
		val = pon->PON_REG_PON_FUNC_CLK_CTRL;
		val &= (~PON_MASK_SCLK_TIMER0_SEL);
		val |= ((sel_val & 0x3) << PON_SHIFT_SCLK_TIMER0_SEL);
		pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		break;
	case TIMER1_SYS:
		val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
		val &= (~SYSON_S_MASK_SYS_TG1_SRC_SEL);
		val |= ((sel_val & 0x3) << SYSON_S_SHIFT_SYS_TG1_SRC_SEL);
		syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		break;
	case TIMER2_SYS:
		val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
		val &= (~SYSON_S_MASK_SYS_TG2_SRC_SEL);
		val |= ((sel_val & 0x3) << SYSON_S_SHIFT_SYS_TG2_SRC_SEL);
		syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		break;
	case TIMER3_SYS:
		val = syson_s->SYSON_S_REG_SYS_TIMER_CTRL;
		val &= (~SYSON_S_MASK_SYS_TG3_SRC_SEL);
		val |= ((sel_val & 0x3) << SYSON_S_SHIFT_SYS_TG3_SRC_SEL);
		syson_s->SYSON_S_REG_SYS_TIMER_CTRL = val;
		break;
	case ENC_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val &= ~SYSON_S_MASK_SYS_ENCODER_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_ENCODER_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
		break;
	case NN_SYS:
		val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
		val &= ~SYSON_S_MASK_SYS_NN_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_NN_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_NN_CTRL = val;
		break;
	case SPORT_SYS:
		val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
		val &= ~SYSON_S_MASK_SYS_SPORT_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_SPORT_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		break;
	case ISP_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val &= ~SYSON_S_MASK_SYS_ISP_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_ISP_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
		break;
	// 0: 200Mhz /s4, 1: 166Mhz /c5 2: 125Mhz /c2
	// 3: 100Mhz /s5, 4: 83Mhz /c6

	case MIPI_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val &= ~SYSON_S_MASK_SYS_MIPI_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_MIPI_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_ISP_CTRL = val;
		break;
	// 0: 250Mhz /c1, 1: 200Mhz /s4, 2: 166Mhz /c5
	// 3: 125Mhz /c2, 4: 100Mhz /s5, 5: 83Mhz /c6

	case FLASH_SYS:
		val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
		val &= ~SYSON_S_BIT_SYS_FLASH_SRC_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_FLASH_SRC_SEL;
		syson_s->SYSON_S_REG_SYS_FLASH_CTRL = val;
		break;
	// 0: 250Mhz /c1, 1: 200Mhz

	case GPIO_AON:
		// interrupt clk source selection for AON GPIO
		// 0: 100kHz, /1: 4MHz
		val = aon->AON_REG_AON_CLK_CTRL;
		val &= ~AON_BIT_INT_CLK_SEL;
		val |= sel_val << AON_SHIFT_INT_CLK_SEL;
		aon->AON_REG_AON_CLK_CTRL = val;
		break;

	case GPIO_PON:
		// interrupt clk source for PON GPIO
		// 0:APB CLK /1:32kHz
		val = pon->PON_REG_PON_FUNC_CLK_CTRL;
		val &= ~PON_BIT_INTR_CLK_GPIO_SEL;
		val |= sel_val << PON_SHIFT_INTR_CLK_GPIO_SEL;
		pon->PON_REG_PON_FUNC_CLK_CTRL = val;
		break;

	case GPIO_SYS:
		// interrupt clk source for SYSON GPIO
		// 0: APB, /1: debounce clock
		val = syson_s->SYSON_S_REG_GPIO_CTRL;
		val &= ~SYSON_S_BIT_SYS_GPIO_INTR_CLK_SEL;
		val |= sel_val << SYSON_S_SHIFT_SYS_GPIO_INTR_CLK_SEL;
		syson_s->SYSON_S_REG_GPIO_CTRL = val;
		break;

	case AUDIO_CODEC_LDO_TUNE:
		val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
		val &= ~SYSON_S_MASK_SYS_CODEC_LDO_TUNE;
		val |= sel_val << SYSON_S_SHIFT_SYS_CODEC_LDO_TUNE;
		syson_s->SYSON_S_REG_SYS_AUDIO_CTRL = val;
		break;

	default:
		break;
	}
}


SECTION_SYS_CTRL_TEXT
uint32_t hal_rtl_sys_get_clk(uint8_t id)
{
	SYSON_S_TypeDef *syson_s = SYSON_S;
	AON_TypeDef *aon = AON;
	PON_TypeDef *pon = PON;
	volatile uint32_t val = 0;


	switch (id) {
	case CPU_SYS:
		val = aon->AON_REG_AON_PMC_CTRL;
		val = (val & AON_MASK_SYSON_PLL_SWITCH) >> AON_SHIFT_SYSON_PLL_SWITCH;
		// 0:500Mhz, 1:400Mhz 2:300Mhz
		break;
	case ENC_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val = (val & SYSON_S_MASK_SYS_ENCODER_SRC_SEL) >> SYSON_S_SHIFT_SYS_ENCODER_SRC_SEL;
		// 0: 166Mhz /c5, 1: 125Mhz /c2 2: 100Mhz /s5
		break;
	case ISP_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val = (val & SYSON_S_MASK_SYS_ISP_SRC_SEL) >> SYSON_S_SHIFT_SYS_ISP_SRC_SEL;
		// 0: 200Mhz /s4, 1: 166Mhz /c5 2: 125Mhz /c2
		// 3: 100Mhz /s5, 4: 83Mhz /c6
		break;
	case MIPI_SYS:
		val = syson_s->SYSON_S_REG_SYS_ISP_CTRL;
		val = (val & SYSON_S_MASK_SYS_MIPI_SRC_SEL) >> SYSON_S_SHIFT_SYS_MIPI_SRC_SEL;
		// 0: 250Mhz /c1, 1: 200Mhz /s4, 2: 166Mhz /c5
		// 3: 125Mhz /c2, 4: 100Mhz /s5, 5: 83Mhz /c6
		break;
	case NN_SYS:
		val = syson_s->SYSON_S_REG_SYS_NN_CTRL;
		val = (val & SYSON_S_MASK_SYS_NN_SRC_SEL) >> SYSON_S_SHIFT_SYS_NN_SRC_SEL;
		// 0: 500Mhz /c0, 1: 400Mhz /s15, 2: 250Mhz /c1
		break;
	case FLASH_SYS:
		val = syson_s->SYSON_S_REG_SYS_FLASH_CTRL;
		val = (val & SYSON_S_BIT_SYS_FLASH_SRC_SEL) >> SYSON_S_SHIFT_SYS_FLASH_SRC_SEL;
		break;
	case SPORT_SYS:
		val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
		val = (val & SYSON_S_MASK_SYS_SPORT_SRC_SEL) >> SYSON_S_SHIFT_SYS_SPORT_SRC_SEL;
		// 0: 40Mhz , 1: 98.304Mhz, 2: 45.158Mhz
		break;

	case GPIO_AON:
		// Get interrupt clk source selection for AON GPIO
		val = aon->AON_REG_AON_CLK_CTRL;
		val = (val & AON_BIT_INT_CLK_SEL) >> AON_SHIFT_INT_CLK_SEL;
		// 0: 100kHz, /1: 4MHz
		break;

	case GPIO_PON:
		// interrupt clk source for PON GPIO
		val = pon->PON_REG_PON_FUNC_CLK_CTRL;
		val = (val & PON_BIT_INTR_CLK_GPIO_SEL) >> PON_SHIFT_INTR_CLK_GPIO_SEL;
		// 0:APB CLK /1:32kHz
		break;

	case GPIO_SYS:
		// interrupt clk source for SYSON GPIO
		val = syson_s->SYSON_S_REG_GPIO_CTRL;
		val = (val & SYSON_S_BIT_SYS_GPIO_INTR_CLK_SEL) >> SYSON_S_SHIFT_SYS_GPIO_INTR_CLK_SEL;
		// 0: APB, /1: debounce clock
		break;

	case AUDIO_CODEC_LDO_TUNE:
		val = syson_s->SYSON_S_REG_SYS_AUDIO_CTRL;
		val = (val & SYSON_S_MASK_SYS_CODEC_LDO_TUNE) >> SYSON_S_SHIFT_SYS_CODEC_LDO_TUNE;
		break;

	default:
		break;
	}
	return val;

