swang-wyze/AmebaPro2_SDK_v9.0a/component/soc/8735b/fwlib/rtl8735b/lib/source/rom_s/rtl8735b_sys_ctrl.c
}

/**
 *  @brief Write the non-fixed secure JTAG key.
 *
 *  @param[in] pkey The key data of the non-fixed secure JTAG.
 *
 *  @returns void
 */
SECTION_SYS_CTRL_TEXT
void hal_rtl_vdr_s_jtag_key_write(uint8_t *pkey)
{
	VNDR_S_TypeDef *vdr_s = (VNDR_S_TypeDef *)VNDR_S_BASE;
	volatile uint32_t *pkey_reg;
	uint32_t i;
	uint32_t key_data;

	pkey_reg = &(vdr_s->VNDR_S_REG_NON_FIXED_SECURE_KEY0);
	//dbg_printf("pkey_reg S:%x\r\n", pkey_reg); // weide for debug

	for (i = 0; i < 8; i++) {
		key_data = *(pkey + 3) << 24 | *(pkey + 2) << 16 | *(pkey + 1) << 8 | *(pkey);
		*pkey_reg = key_data;
		//dbg_printf("pkey_reg++ S:%x Data:%x\r\n", pkey_reg, *pkey_reg); // weide for debug
		pkey_reg++;
		pkey += 4;
	}
	vdr_s->VNDR_S_REG_SECURE_JTAG_SWD_CTRL |= VNDR_S_BIT_FW_READY_SC;
}


/**
 *  @brief Write the non-fixed non-secure JTAG key.
 *
 *  @param[in] pkey The key data of the non-fixed non-secure JTAG.
 *
 *  @returns void
 */
SECTION_SYS_CTRL_TEXT
void hal_rtl_vdr_ns_jtag_key_write(uint8_t *pkey)
{
	VNDR_S_TypeDef *vdr_s = (VNDR_S_TypeDef *)VNDR_S_BASE;
	volatile uint32_t *pkey_reg;
	uint32_t i;
	uint32_t key_data;

	pkey_reg = &(vdr_s->VNDR_S_REG_NON_FIXED_NON_SECURE_KEY0);
	//dbg_printf("pkey_reg NS:%x\r\n", pkey_reg); // weide for debug

	for (i = 0; i < 8; i++) {
		key_data = *(pkey + 3) << 24 | *(pkey + 2) << 16 | *(pkey + 1) << 8 | *(pkey);
		*pkey_reg = key_data;
		//dbg_printf("pkey_reg++ NS:%x Data:%x\r\n", pkey_reg, *pkey_reg); // weide for debug
		pkey_reg++;
		pkey += 4;
	}
	vdr_s->VNDR_S_REG_SECURE_JTAG_SWD_CTRL |= VNDR_S_BIT_FW_READY_NONSC;
}

SECTION_SYS_CTRL_TEXT
uint32_t hal_rtl_sys_get_video_info(uint8_t idx)
{
	AON_TypeDef *aon = AON;
	volatile uint32_t val = 0;

	switch (idx) {
	case VIDEO_INFO_NN:
		val = ((aon->AON_REG_AON_OTP_SYSCFG5 & AON_BIT_NN_CTRL) >> AON_SHIFT_NN_CTRL);
		break;
	case VIDEO_INFO_H265:
		val = ((aon->AON_REG_AON_OTP_SYSCFG5 & AON_BIT_H265_CTRL) >> AON_SHIFT_H265_CTRL);
		break;
	case VIDEO_INFO_ENC:
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
		val = ((aon->AON_REG_AON_OTP_SYSCFG5 & AON_BIT_ENC_CTRL) >> AON_SHIFT_ENC_CTRL);
#endif
		break;
	case VIDEO_INFO_ISP:
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
		val = ((aon->AON_REG_AON_OTP_SYSCFG5 & AON_BIT_ISP_CTRL) >> AON_SHIFT_ISP_CTRL);
#endif
		break;
	default:
		dbg_printf("get video_info fail idx!(%d)\r\n", idx);
		break;
	}
	return val;
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_set_video_info(uint8_t idx, uint8_t en_ctrl)
{
	AON_TypeDef *aon = AON;
	volatile uint32_t val = 0;

	val = (aon->AON_REG_AON_OTP_SYSCFG5);
	switch (idx) {
	case VIDEO_INFO_NN:
		if (ENABLE == en_ctrl) {
			val |= AON_BIT_NN_CTRL;
		} else {    // Disable
			val &= (~AON_BIT_NN_CTRL);
		}
		break;
	case VIDEO_INFO_H265:
		if (ENABLE == en_ctrl) {
			val |= AON_BIT_H265_CTRL;
		} else {    // Disable
			val &= (~AON_BIT_H265_CTRL);
		}
		break;
	case VIDEO_INFO_ENC:
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
		if (ENABLE == en_ctrl) {
			val |= AON_BIT_ENC_CTRL;
		} else {    // Disable
			val &= (~AON_BIT_ENC_CTRL);
		}
#endif
		break;
	case VIDEO_INFO_ISP:
#if IS_AFTER_CUT_A(CONFIG_CHIP_VER)
		if (ENABLE == en_ctrl) {
			val |= AON_BIT_ISP_CTRL;
		} else {    // Disable
			val &= (~AON_BIT_ISP_CTRL);
		}
#endif
		break;
	case VIDEO_INFO_ALL:
#if IS_CUT_TEST(CONFIG_CHIP_VER)
		val &= (~(AON_BIT_NN_CTRL | AON_BIT_H265_CTRL));       // clear [10:9]
#else
		val &= (~(AON_BIT_NN_CTRL | AON_BIT_H265_CTRL | AON_BIT_ENC_CTRL | AON_BIT_ISP_CTRL));       // clear [12:9]
#endif
		val |= ((en_ctrl & 0xF) << AON_SHIFT_NN_CTRL);
		break;
	default:
		dbg_printf("set video_info fail idx!(%d)\r\n", idx);
		return;
		break;
	}
	aon->AON_REG_AON_OTP_SYSCFG5 = val;
}

SECTION_SYS_CTRL_TEXT
void hal_rtl_sys_get_chip_id(uint32_t *pchip_id)
{
	uint32_t otp_idx = 0x0;
	uint8_t otp_data[OTP_CHIP_ID_MAX_SIZE];
	uint8_t *p_otp_v = NULL;

	hal_rtl_otp_init();
	p_otp_v = &otp_data[0];
	_memset(p_otp_v, 0xFF, OTP_CHIP_ID_MAX_SIZE);
	*pchip_id = 0x0;
	// Get chip ID from OTP
	hal_rtl_otp_rd_syss(OTP_ENABLE, OTP_CID_DAT_ADDR, p_otp_v, OTP_CHIP_ID_MAX_SIZE);
	for (otp_idx = 0; otp_idx < OTP_CHIP_ID_MAX_SIZE; otp_idx++) {
		//*(p_otp_v + otp_idx) = hal_rtl_otp_byte_rd_syss((OTP_CID_DAT_ADDR + otp_idx));
		*pchip_id |= (*(p_otp_v + otp_idx) << (8 * otp_idx));
	}
	hal_rtl_otp_deinit();
}


/** @} */ /* End of group hs_hal_efuse */
